Revit 2024 API
SaveOptions Members
The SaveOptions type exposes the following members.
Constructors
Name | Description
SaveOptions
 Default constructor.
Methods
Name | Description
Dispose
Releases all resources used by the SaveOptions
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Compact
 Default is false: let the OS eliminate as much or as little dead data as it wants to. True: force the OS to eliminate all dead data from the file on disk.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
PreviewViewId
 The view id that will be used to generate the preview; this id is not saved to the document's permanent settings.
See Also
SaveOptions Class
Autodesk.Revit.DB Namespace